Repository: loginom/admin-guide-l10n
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Следующим этапом обработки может быть применение команды ОС (операционной системы).
en: The next processing stage can be an application of the OS command.

source: Службы LoginomServer и LoginomHttpd не запускается после установки автоматически.
en: LoginomServer and LoginomHttpd services are not started in the installation process automatically.

source: Согласно описанию SOAP-протокола, xml-запрос к веб-сервису содержится в теле узла Body SOAP-пакета.
en: According to the SOAP protocol description, the XML request to the web service is in the node body Body of the SOAP package.

source: Содержание выходного файла передается на следующий этап обработки.
en: The output file content is then transferred to the next processing stage.

source: Содержат единственный компонент Loginom Desktop.
en: They contain only one component - Loginom Desktop.

source: Содержат параметры настроек, представленных в разделе Параметры настроек методов взаимодействия с внешними сервисами.
en: They contain parameters of the settings listed in the following section Setting Parameters of Methods of Interaction with the External Services.

source: Содержат параметры настроек, представленных в разделе Параметры настроек подключения к внешним сервисам.
en: contain parameters of the settings listed in the following section: Setting Parameters of Connection to the External Services.

source: Содержит параметры общих настроек Адаптера, представленных в разделе Параметры общих настроек.
en: contains parameters of the general settings of the Adapter represented in the following section: Parameters of the General Settings.

source: Соединение с Loginom Server
en: Connection with Loginom Server

source: Создание виртуального каталога для Loginom Studio
en: Creation of the Virtual Directory for the Loginom Studio

source: Создать в IIS web-приложение в новом пуле, указав путь к расположению файлов Integrator
en: To create web application in IIS in the new pool, having specified the path to the Integrator files location

source: Создать в IIS пул приложений в режиме Integrated и версией среды CLR v4.0
en: To create application pool in IIS in theIntegrated mode and CLR v4.0 environment version

source: Список устанавливаемых компонентов
en: List of the installed components

source: Сравнение вариантов физических ключей
en: Comparison of the Physical Dongles Versions

source: Строка запроса (Request Line)
en: Request line (Request Line)

source: Структура (tipe) входящего сообщения (запроса) метода Cheques сервиса DIS_stend-sup-29 в узле <wsdl:message name="DIS_stend-sup-29_Cheques_InputMessage"> задается определяемым в этой схеме элементом Cheques.
en: (tipe) structure of the incoming message (request) of the Cheques method of the DIS_stend-sup-29 service in the <wsdl:message name="DIS_stend-sup-29_Cheques_InputMessage"> node is set by the Cheques element defined in this schema.

source: Существует время, в течение которого Адаптер ожидает ответа от внешнего сервиса.
en: There is a period when the Adapter waits for the response from the external service.

source: Схема описывает структуру XML-сообщений запросов и ответов веб-сервиса Адаптера и участвует в формировании WSDL-описания сервиса.
en: The schema describes the structure of the XML messages of requests and responses of the Adapter web service, and participates in the generation of the WSDL service description.

source: Схема, на которую будет ссылаться описание сервиса
en: The schema to which the service description will refer

source: Также в формировании WSDL участвует обязательный компонент настроек – XSD-схема описания сервиса, путь к которой указывается в параметре Схема, на которую будет ссылаться описание сервиса.
en: The compulsory configuration component also participates in the WSDL formation process – the XSD schema of the service description; a path to it is specified in The schema to which the service description will refer the parameter.

source: Также он необходим для использования wsproxy.
en: It is also required for wsproxy usage.

source: Также следует удалить созданный специально для Адаптера пул приложения.
en: It is also required to delete the application pool created specially for the Adapter.

source: Также утилиту можно запустить из апплета панели управления "Драйверы Guardant" кнопкой "Диагностика".
en: The ulility can be also started from the applet of the "Guardant Drivers" control panel using the "Diagnostics" button.

source: Таким образом, XSD-схема описания сервиса должна содержать эти элементы и задавать их структуру (tipe), а из настроек Адаптера должно быть понятно, какое именно сообщение описывается определенным элементом импортируемой схемы.
en: Thus, the XSD schema of the service description must contain these elements and set their (tipe) structure; and the Adapter settings must be clear enough to understand what message is described by the particular element of the imported schema.

source: Такой способ рекоммендуется использовать для сертификатов, не содержащих закрытый ключ.
en: It is recommended to use this method for certificates that do not contain a private key.

source: Тело сообщения (Entity Body)
en: Message body (Entity Body)

source: Тип отправляемого запроса (REST или SOAP) определяется параметром Формат сообщения.
en: Type of sent request (REST or SOAP) is determined by the Message format parameter.

source: Типичная схема взаимодействия компонентов системы с использованием Адаптера
en: Typical scheme of interaction of the system components using the Adapter

source: Требует инсталляции и функционирует в виде службы Microsoft IIS.
en: It must be installed and can be used as Microsoft IIS service.

source: Требует инсталляции и функционирует в виде службы Windows.
en: It must be installed and can be used as Windows service.

source: Требует развертывания сервера сетевых ключей версии не ниже 7.0.
en: Deployment of network dongles server version 7.0 or higher is required.

source: Требует установки драйверов Guardant версии не ниже 7.0.
en: Guardant drivers version 7.0 or higher are required.

source: Требуют инсталляции и функционируют в виде Windows приложения.
en: They must be installed and can be used as Windows applications.

source: Убедитесь, что установленные антивирусы и межсетевые экраны разрешают эти подключения.
en: Make sure that installed antivirus software and network firewalls allow for such connections.

source: Удаление Loginom Adapter
en: Uninstalling Loginom Adapter

source: Удаление Loginom Desktop
en: Uninstalling Loginom Desktop

source: Удаление Loginom Integrator
en: Uninstalling Loginom Integrator

source: Удаление Loginom Server
en: Loginom Server Removal

source: Удалить приложение из окна "Программы и компоненты" в Windows;
en: To uninstall the application from the "Applications and Components" window in Windows

source: Управление
en: Management

source: Управление сервером, настройка, визуализация и прочие операции осуществляются при помощи Loginom Studio.
en: The Loginom Studio provides for server management, configuration, visualisation and other operations.

source: Установка Loginom Desktop
en: Loginom Desktop Installation

source: Установка Loginom Integrator
en: Loginom Integrator Installation

source: Установка Loginom Server
en: Loginom Server Installation

source: Установка Loginom Server при использовании Apache или Microsoft IIS различна.
en: The Installation method for the Loginom Server is different, depending on whether Apache or Microsoft IIS is selected.

source: Установка MSI
en: MSI Installation

source: Установка модуля Rewrite
en: Installation of the Rewrite Module

source: Установленный драйвер Guardant версии не ниже 6.0.
en: Installed Guardant driver, version 6.0 or higher.

source: Утилита GuardantActivationWizard.exe, поставляющаяся в комплекте с SP-ключом.
en: GuardantActivationWizard.exe utility supplied with SP dongle.

source: Утилита диагностики Guardant предназначена для тестирования ключей защиты на предмет наличия и работоспособности.
en: Guardant diagnostic utility is required for dongles testing to check availability and operability.

source: Утилита диагностики автоматически собирает информацию о системе, проводит тестирование электронных ключей Guardant и подготавливает отчет для службы технической поддержки.
en: The diagnostic utility automatically collects information on the system, tests electronic Guardant dongles and draws help desk report.

source: Утилита устанавливается вместе с драйверами Guardant.
en: The utility is installed with Guardant drivers.

source: Учетные записи
en: Accounts

source: Файлы журналов сохраняются в подкаталоге Logs рабочего каталога.
en: The log files are kept in the Logs subdirectory of the working directory.

source: Файлы конфигурации Loginom Server располагаются в рабочем каталоге.
en: The Loginom Server configuration files are in the working directory.

source: Файрволл
en: Firewall

source: Флаг нужно указывать для веб-сервисов, в WSDL-описании которых задана политика UsingAddressing.
en: It is required to place the flag for the web services in the WSDL description of which UsingAddressing policy is specified.

source: Функциональная схема работы
en: Functional Operation Scheme

source: Функциональная схема работы Адаптера представлена на рисунке 7.
en: The functional operation scheme of the Adapter is shown in Figure 7.

source: Функциональная схема работы Адаптера
en: The Functional Operation Scheme of the Adapter

source: Хост Loginom Server
en: Loginom Server host

source: Хост с веб-сервером должен разрешать подключения:
en: The host with the web server must allow for connections:

source: Хост с сервером Loginom должен разрешать подключения:
en: The host with the Loginom server must allow for connections:

source: Хранилище пользователя доступно только для определенного пользователя.
en: The user store is available only for a particular user.

source: Хранилище сертификатов должно быть доступно для пользователя, из-под которого работает пул приложений Адаптера в IIS.
en: The certificate store must be available for a user who operates the Adapter application pool in IIS.

source: Целевые поля для записи данных события можно задать двумя способами: привязать поля журнала к полям таблицы, либо задать SQL запрос.
en: Target fields for the event data record can be specified in two ways: it is possible to bind the log fields to the table fields or to send SQL query.

source: Чтобы активировать ключ Guardant SP, запустите мастер активации GuardantActivationWizard.exe и следуйте его указаниям:
en: To activate Guardant SP dongle, it is required to run GuardantActivationWizard.exe activation wizard and to follow its instructions:

source: Элементы второго уровня:
en: The elements of the second level:

source: Элементы первого (корневого) уровня:
en: The elements of the first (root) level:

source: Эта информация выводится при запросе WSDL сервиса.
en: This information is shown while requesting the WSDL service.

source: Эти атрибуты однозначно идентифицируют элементы в XSD-схеме и задаются следующими параметрами:
en: These attributes clearly identify the elements in the XSD schema, and they are set by the following parameters:

source: Эти временные файлы так же будут располагаться в папке с Web.config, а по окончании обработки удалятся.
en: These temporary files will be also placed into the folder with Web.config. They will be deleted after processing.

source: Эти правила выполнения этапа применяются и при преобразовании командой OC ответов сервиса с использованием параметров Исходное имя файла ответа, Результирующее имя файла ответа, Команда обработки файла ответа.
en: These stage execution rules are also applied in the case of transformation of the service responses by the OS command with an application of the following parameters: The response file source name, The resulting name of the response file, The response file processing command.

source: Это можно сделать через пункт Добавить пул приложений… (Add Application Pool…) в контекстном меню элемента Пулы приложений (Application Pools).
en: This task is possible by using the Add Application Pool… (Add Application Pool…) item in the context menu of the Application Pools (Application Pools) element.

source: Это особенно удобно при работе в корпоративной сети, так как чаще всего Loginom запускают сразу не все пользователи, у которых он установлен.
en: It is particularly convenient in the case of the corporate network usage when Loginom is typically started not by all users who installed it.

source: Это позволит получить детальную информацию для решения возможных проблем с настройкой.
en: It will enable you to get detailed information to resolve possible configuration problems.

source: Это позволяет переносить Адаптер с одного компьютера на другой простым копированием папки с минимальным количеством перенастроек.
en: It enables the transfer of the Adapter from one computer to another just copying the folder with the minimum reconfiguration number.

source: Этот файл выполняет роль ссылки для Адаптера на сертификат в хранилище.
en: This file serves as a reference to the store certificate for the Adapter.

source: Являясь промежуточным веб-сервисом, Адаптер одновременно выполняет роль клиента по отношению к внешнему сервису (например, к бюро кредитных историй – БКИ) и роль SOAP-веб-сервиса по отношению к сценарию Loginom (или любому другому стороннему потребителю информации).
en: Being an intermediate web service, the Adapter serves both as a client concerning the external service (for example, concerning the Credit Reference Bureau – CRB), and the SOAP web service, with regard to Loginom workflow (or any other outside information user).

source: в разделе Установка.
en: the Installation section.

source: в разделе Настройка роли клиента внешних сервисов.
en: the following section: Configuration of the Client Role of the External Services.

source: где 6.x.x – цифры, обозначающие версию и релиз программы.
en: where 6.x.x – figures denoting software version and release.

source: либо в браузере (рекомендуется Chrome) по URL: http://localhost/app/.
en: or in the browser (Chrome is recommended) using the following URL: http://localhost/app/.

source: от 1 ТB (+ User Data)
en: from 1 ТB (+ User Data)

source: при использовании websocket proxy — только для хоста веб-сервера.
en: using websocket proxy — only for the web server host.

source: раздел Работа с сертификатами.
en: the Certificates Usage section.

source: раздел Настройка роли клиента внешних сервисов.
en: the following section: Configuration of the Client Role of the External Services.

source: размер входящего сообщения — максимально допустимый размер входящего xml-сообщения в байтах (по умолчанию 10 Мб).
en: size of the incoming message — the maximum allowed size of the incoming XML message in bytes (by default - 10 MB).

source: рисунок 3), отображающее структуру настроек, на правой — сами настройки.
en: Figure 3). It reflects the settings structure. The settings as such are on the right panel.

source: рисунок 4).
en: Figure 4).

source: рисунок 5).
en: Figure 5).

source: рисунок 6).
en: Figure 6).

source: также раздел Работа с сертификатами).
en: the Certificates Usage section).

source: ярлыком Все программы\Loginom 6\Studio\Loginom Studio из меню "Пуск" Windows
en: using the All programs\Loginom 6\Studio\Loginom Studio shortcut from the "Start" Windows menu,
